--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                       ▀▄ ▄▀ 
▀▄ ▄▀       BY ahmed_al_zaen              ▀▄ ▄▀ 
▀▄ ▄▀ BY ahmed_al_zaen(@ahmed_al_zaen)         ▀▄ ▄▀          
▀▄ ▄▀ JUST WRITED BY ahmed_al_zaen        ▀▄ ▄▀   
▀▄ ▄▀          HELP1  : مساعدة              ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

local function run(msg, matches)
local reply_id = msg['id']
if is_momod(msg) and matches[1]== 'مساعدة' then
local S = [[ 
✔️- الاوامر ادارة المجموعة- 
✔️- رفع الادمنيه والادارين في المجموعه
✔️-لحظر والطرد الاعضاء في المجموعة
``````````````````````
👮️-رفع اداري: لرفع اداري
❎-تنزيل اداري : لحذف الاداري 
✔️️-رفع المدير : اضافة #مدير
🙇-رفع ادمن : لاضافة  ادمن
✖️-تنزيل ادمن : تنزيل ادمن
🤖️-اضف مطور +المعرف
👫️-الادمنيه : اضهار الادمنيه
👤️-مدير المجموعه : اضهار المدير
💠💯اوامر الطرد في الكروب
🚶-بلوك : لطرد المستخدم
🏃-حظر :  لحضر المستخدم
🗣-الغاء الحظر : لفك حضر المستخدم
🚼-مغادره : للخروج من لمجموعه
🙏-كتم  : لكتم المستخدم
👻-كتم  : لالغاء كتم المستخدم
😷-المكتومين  :عرض المكتومين
✍-منع : لحضر الكلمات في المجموعه
🔞-الغاء المنع  : لفتح حضر الكلمه
📖-قائمه المنع  : لعرض الكلمات المحضوره
🚷-حظر عام : باند عام
🚯-الغاء العام : لالغاء العام
👥-قائمه العام  : لعرض المحضورين عام
🌐💠 - اوامر الكروب الاعتيادية
✋-ايدي : لعرض ايدي المجموعه
✊-ايدي : لضهار ايدي الشخص بلرد
📲-معلوماتي :اضهار المعلومات الخاصه بك
📱-معلومات المجموعه : لاضهار معلومات المجموعه
🎎-القوانين : لاضهار القوانين
🗑-مسح : لمسح اي  كلمه بل رد
1⃣-ضع قوانين : اضافه قوانين
2⃣-ضع وصف : اضافة حول 
3⃣-وضع اسم : لاضافة اسم
4⃣-ضع معرف: لوضع معرف للكروب
🎡-وضع صوره : لاضافة صورة
📫-الرابط خاص : لجلب الرابط خاص
📭-الرابط : لعرض الرابط
🔄-تغير الرابط : لصنع الرابط
🌚-شنو اني :لمعرفه موقعك في المجموعه
💻-الاعدادات : اضهار الاعدادات المجموعه
🖼اعدادات الوسائط:اضهار اعدادات الوسائط
 🔸➖🔹➖🔸➖🔹➖
🔶DEV : @ahmed_al_zaen المطور البوت
🔶DEV : @al_zaenbot للمحضورين من هنا
🔶Group Link : @al_zaen1 اشترك بالقناه 
]]
reply_msg(reply_id, S, ok_cb, false)
end

if not is_momod(msg) then
local S = "للمشرفين فقط 😎🖕🏿"
reply_msg(reply_id, S, ok_cb, false)
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"^(مساعدة)$",
},
run = run 
}
end
