-- made by { @ahmed_al_zaen }
do
ws = {}
rs = {}

-- some examples of how to use this :32

ws[1] = "السلام عليكم" -- msg 
rs[1] =  "وعليكم السلام ورحمة الله هلا اغاتي" -- reply

ws[2] = "بوسني" -- msg 
rs[2] =  "مووواح فدوه لربك❤️🙈" -- reply

ws[3] = "الزين" -- msg 
rs[3] =  "ها حياتي😻❤️" -- reply

ws[4] = "احمد" -- msg
rs[4] = "هذا الي صنعني فديت ربه 🙈❤️" -- reply

ws[5] = "شلونكم" -- msg
rs[5] = " تمام حياتي وانت شلونك😍❤️" -- reply

ws[6] = "ضوجه" -- msg 
rs[6] = "شي اكيد الكبل ماكو 😂 لو بعدك/ج مازاحف" -- reply

ws[7] = "زاحف" -- msg 
rs[7] = "😕😹 زاحف من نوعية فاخره اكيد ولا تلكي شخص مثلي🌚" -- reply

ws[8] = "احبك" -- msg 
rs[8] ="خخ فدوه اروحلك انا امواح🙈❤️" -- reply

ws[9] = "بوس الاعضاء" -- msg 
rs[9] =" 💋مــــح فديت الاعضاء من جكمه الى الاجكم😍😹😷💛️" -- reply

ws[10] = "تحبني" -- msg 
rs[10] =" شعندي غيرك/ج يبعد رويحتي😻❤️️" -- reply

ws[11] = "منو صنعك" -- msg 
rs[11] =" احمد الزين فديت ربك  مــواأح😻❤️️" -- reply

ws[12] = "باي" -- msg 
rs[12] ="بايات حياتي انته الله وياك👋😽️" -- reply

ws[13] = "شغال" -- msg 
rs[13] =" ✅ يب كلبي🙈 هذا البوت الزين 😹" -- reply

ws[14] = "هلوو" -- msg 
rs[14] ="😳هلوات وكوسترات🚌🚌 محملات بالورود❤️لعيونك ياغالي/ه نورت/ي🙈😂"  -- reply

ws[15] = "احمد الزين" -- msg 
rs[15] ="فديته للحلو اني اخ لو بس يخليني😉❤️️" -- reply

ws[16] = "شكد" -- msg 
rs[16] ="اكثر من ما تتصور😍😍❤️️" -- reply

ws[17] = "اريد اكبل" -- msg 
rs[17] =" خخ اني هم اريد اكبل قابل ربي وحد😹🙌️" -- reply

ws[18] = "اتفل" -- msg 
rs[18] ="ختفوووووووووو💦💦️️" -- reply

ws[19] = "شلونك" -- msg 
rs[19] ="تمام بحي وانت/ي شلونك😍😍😍️️" -- reply

ws[21] = "شنو رائيك بهذه" -- msg 
rs[21] ="فديت ربه هذه ورده مال الله  فدوه يروحله المدير وكل الادمنيه مووواح💋😍️️" -- reply

ws[22] = "الزين شنو رئيك بهذا الولد" -- msg 
rs[22] ="هذه فد واحد سرسري وزاحف وساقط و يضحك ع البنات سوالفه كلها عندي😒😒️️" -- reply

ws[23] = "تخليني" -- msg 
rs[23] ="عيب منا عالم تعال وره ال 12 كلها نايمه😉️️" -- reply

ws[24] = "احمد وينك" -- msg 
rs[24] ="بشغول حاليا تعال لكروب الدعم واذا ماكو يعني مشغول️️" -- reply

ws[25] = "اكرهك" -- msg 
rs[25] ="🐸 عساس اني مرغل نفسي عليك/ج بالتراب 😹وجه البطريق😿️️" -- reply

ws[26] = "شكو ماكو" -- msg 
rs[26] ="غيرك/ج بل كلب ماكو يبعد كلبي😍❤️️" -- reply

ws[27] = "اكلك" -- msg 
rs[27] ="كول يعمري😍❤️️" -- reply

ws[28] = "شكو" -- msg 
rs[28] =" 🌚😹 باكو شي حبيت اخذ بوسه منك/ج وانام😘️" -- reply

ws[29] = "اوف" -- msg 
rs[29] ="🚶🏿😂 امشي نروح للديسكو نحتسي الخمر وتروح الضوجة😹️️" -- reply

ws[30] = "يلة" -- msg 
rs[30] ="🌚😹 اوكف خلي البس 🏃حذائي والقاط الجديد علمود الحتات🚶🏻️️" -- reply

ws[31] = "😒" -- msg 
rs[31] ="🌚🙊 شبيك جرارت كلبي ضايج/ة🙏️️" -- reply

ws[32] = "شنو انته" -- msg 
rs[32] ="اني بوت طيح الله حضك ههههههه️️" -- reply

ws[33] = "🙊" -- msg
rs[33] ="🙊اي بويه السالفه يرادلها تفكير 🤕 فكر وياك ونسوي حل لهل مشكله😂" -- reply

ws[34] = "مساء الخير" -- msg
rs[34] = "مساء النور ❤️والسرور💋 يابعد كلبي" -- reply 

ws[35] = "تعال خاص" -- msg 
rs[35] = "😳 اها راح تروحون خاص😹شسون بالخاص😳🐍قليلين 👀الادب" -- reply 

ws[36] = "🌚" -- msg 
rs[36] = "😂 شبيك/ج الله مصخم 🤓وجهك بكل الكروبات😻😹" -- reply 

ws[37] = "😂" -- msg 
rs[37] = "😘❤️دووووم ❤️الضحكه 😂🙈" -- reply 

ws[38] = "صباح الخير" -- msg 
rs[38] = "❤️ صباح النور 😳 والياسمين 💋 ياعمري انت/ي☺️" -- reply

ws[39] = "تصبحون على خير" -- msg 
rs[39] = "🤒تلاقي الخير ياروحي انت/ي🏃🙈" -- reply

ws[40] = "تسلم" -- msg 
rs[40] = "ادلل حبي 😘🌹" -- reply

ws[41] = "شكد" -- msg
rs[41] = "اكثر مما تصور 🙊❤️" -- reply 

ws[42] = "والله بواهسي اروح للزوراء" -- msg 
rs[42] = "ليش" -- reply

ws[43] = "اغير جو" -- msg 
rs[43] = "😂 تغير جو لو تسحف 🐍 عل بنات" -- reply

ws[44] = "احبج" -- msg 
rs[44] = "اني هم احبك 😍 مح ❤️" -- reply

ws[45] = "شتكول عل زواحف" -- msg
rs[45] = "والله عمي بس الزواحف يكبلون شايفلك شريف كبل ماكو" -- reply

ws[46] = "شكاعد تسوي هسه" -- msg 
rs[46] = "والله لازم البطل والجكارة وصك بيهن" -- reply

ws[47] = "تمام" -- msg
rs[47] = "دووم" -- reply

ws[48] = "هلاو" -- msg 
rs[48] = "😳هلوأت 😹تايرات 🌚بنجرات😂على طريق السريع🐸😹" -- reply

ws[49] = "بوت الزين" -- msg
rs[49] = "ما هذا 😳👌🏻 هذه المجموعة غير محمية سأقوم بتفعيل الحماية لها ☺️✔️" -- reply


ws[50] = "😹" -- msg
rs[50] = "😹هذا المستخدم فاطس 😳من ضحك😹فطير/ة مو بيدك/ج🐸" -- reply


ws[51] = "😳" -- msg 
rs[51] = "🐸 ليش خجلان/ة 😻 يابعد عمري 😳" -- reply


ws[52] = "ولي" -- msg 
rs[52] = "😢 صار استاذي عتبرني🙏 متابع بصمت🐸" -- reply


ws[53] = "😕" -- msg
rs[53] = "🐭شبيك/ج معصب/ه علينا 🙃 وجه طاؤؤؤس😾" -- reply


ws[54] = "الزين شبي الكروب" -- msg 
rs[54] = "🐸اكولك اني صالي 🌚اهوايه يمهم بس زواحف 🐍تلكيهم خوب اذا بنيه طلعت عام تصير دقلات مال زحف ع العام شعب مشكوكه فالينته😹😕" -- reply


ws[55] = "الزين بنيه تحجي عليك" -- msg
rs[55] = "😳ليش تحجي عليه لان زحفتلي 🐸 بالخاص ولبستها😹🐍خلتولي عوفها بضغوطه مني😹" -- reply


ws[56] = "الزين شنو رئيك بهاي البنيه" -- msg 
rs[56] = "😳والله هيه خوش بنيه🐭بس مشكلتها 🐸تعشق الزحف😹 هاي نوعيات الزواحف جيل 2000 كله بدون حقوق😂🙏" -- reply


ws[57] = "اعشقك" -- msg 
rs[57] = "😳شعندي 💋 غيرك/ج ياحياتي وعمري انت/ي🐸😻" -- reply


ws[58] = "💋" -- msg
rs[58] = "😳 ايويلي عسل 💋وربي بوستك عسل🐸مـــح😋" -- reply


ws[59] = "تعال" -- msg
rs[59] = "🐸تعال أبو الإصبع😹" -- reply


ws[60] = "مرحبا" -- msg
rs[60] = "😘مراحب يانبض كلبي انت/ي😳نورت/ي الكروب🙈" -- reply 


ws[61] = "☺️" -- msg
rs[61] = "😳فديت☺️الادب والاخلاق 🙈مالتك/ج❤️" -- reply


ws[62] = "اني" -- msg
rs[62] = "😻اني احبك ليش 💃ليش😳 انت/ي بالذات🐸😹" -- reply


ws[63] = "الزين نكته" -- msg
rs[63] = "*عراقي رجع للعراق بعد الغربه فاول منزل من الطائره خله الجنطه بالكاع ودنك ايبوس تراب الوطن رفع راسه ملكه الجنطه كال رجعنه لطيحان الحظ/🐸😹😹" -- reply


ws[64] = "اريده" -- msg
rs[64] = "🙊 أريده لو مجلة😹" -- reply


ws[65] = "هاي" -- msg
rs[65] = "😹هاي لو كهوة🐸" -- reply


ws[66] = "الزين تحب بنات الكروب" -- msg
rs[66] = "😻 اكيد اموت عليهم اكو واحد يكره نعمه الله 😹😳" -- reply

ws[67] = "تف" -- ms
rs[67] = "☹️عيب تتفل🙄 منا عالم شتكول عليك😹زعطوط/ة🐸" -- reply

ws[68] = "منو صايم" -- msg
rs[68] = "🤕اني بالنسبه اليه ا😿صوم بس عن الاكل والشرب😱 وشوكت😹 ما اجوع اكل مسموحلي😂😋" -- reply

ws[69] = "لوكي" -- msg
rs[69] = "🌚 متلوك لخالتك/ج قبل وجه قرد/ه🐸😂" -- reply

ws[70] = "انجب زاحف" -- msg
rs[70] = "🌚 اذا شايفني فد يوم زاحف 🤕للرضيعه فاني اسف منك/ج 😹😹" -- reply

ws[71] = "اريد بوت" -- msg
rs[71] = "لطلب البوت في المجموعه للمحضورين من هنا✔️ @al_zaenbot : او تحدث مع المطور @ahmed_al_zaen" -- reply

ws[72] = "😂😂" -- msg
rs[72] = "😉 لتَضحَكَ هوأآ‘إيَ ✋🏿 يصيَر فأَولَ 😜 " -- reply 

ws[73] = "🤒" -- msg
rs[73] = "😠 ✋🏿الفَ مرهَ أكول مَمَنــوعَ آلتـدخينَ 😒مشـغل سَبلت علىَ حَضررتَ جنآبـكمَْ 😏🙌🏾 " -- reply 

ws[74] = "فديتك" -- msg
rs[74] = " .✾❣فـ﴿😍﴾ـداكْ❣✾ ✾❣الكـ﴿🌇﴾ـونْ❣✾ .✾❣ومـ﴿💦﴾ـايْ❣✾ .✾❣العـ﴿👀﴾ـيون❣✾ .✾❣والفـ﴿🐭﴾ـارهْ❣✾ .✾❣والبـ﴿🐯﴾ـزونْ❣✾ .✾❣وقنـ﴿📺﴾ـاتْ❣✾ .✾❣سبيـ﴿💃﴾ـستونْ❣✾ .✾❣واااانـ﴿☝️﴾ـااْاا❣✾ .✾❣الممـ﴿☺️﴾ـنونْ❣✾" -- reply  


ws[75] = "غنيلي"
rs[75] = " 🙈 احبك اني  🙊 اني احبك 🙉 واتحدى واحد بلبشر مثلي يحبك 🙊"

ws[76] = "شغل المبردة"
rs[76] = " تم تشغيل المبردة بنجاح ❄️"

ws[77] = "طفي المبردة"
rs[77] = "طفيتهه 😒🍃"

ws[78] = "شغل السبلت"
rs[78] = "شغلته 🌚🍃 بس حثلجون معليه ترا "

ws[79] = "فطور"
rs[79] = "واخيراً 😍😍 خل اروح افطر "

ws[80] = "تركيا"
rs[80] = "😐🍃 فديتهه"

ws[81] = "داعش"
rs[81] = "دي خل يولون 😒❤️"

ws[82] = "الدولة الاسلامية"
rs[82] = "انته داعشي ؟؟ 😒💔"

ws[83] = "سني"
rs[83] = "لتصير طائفي 😒🖐"

ws[84] = "شيعي"
rs[84] = "لتصير طائفي 😕"

ws[85] = "تبادل"
rs[85] = "كافي ملينه 😒😒 ما اريد اتبادل"

ws[86] = "الرمادي"
rs[86] = "احلى ناس ولله 😍🙈"

ws[87] = "من وين"
rs[87] = "شعليك زاحف 😂🔥 "

ws[88] = "🚶"
rs[88] = "وين خليك رايح 🙈🍷"

ws[89] = "البوت"
rs[89] = "معاجبك ؟ 😕😒🍃"

ws[90] = "البوت واكف"
rs[90] = "لتجذب 😒"

ws[91] = "منو ديحذف رسائلي"
rs[91] = "محد 😐🍃"

ws[92] = "كلاش اوف كلانس"
rs[92] = "تلعبهه ؟ شكد لفلك ؟"

ws[93] = "جوني"
rs[93] = "😂 مأذيك ؟"

ws[94] = "ازحف"
rs[94] = " على اختك ازحف 🌚🍃 "

ws[95] = "المنصور"
rs[95] = " احلى ناس ولله "

ws[96] = "المدرسه"
rs[96] = " 😒🍃 الله لا يراوينه "

ws[97] = "منورين"
rs[97] = "🖖منوريــن حبايب كلبي الاعضاء الكرام😍😘 😍🙈😍"

ws[98] = "يعني شكد"
rs[98] = " فوك متتوقع "

ws[99] = "😅"
rs[99] = " دوم حبي ❤️"

ws[100] = "هههه"
rs[100] = " دوم حبي ❤️"

ws[101] = "ههههه"
rs[101] = " دوم حبي ❤️"

ws[102] = "😹"
rs[102] = " دوم حبي ❤️"

ws[103] = "🌝"
rs[103] = " منور صخام الجدر 🌚🍃"

ws[104] = "😍"
rs[104] = " مح فديتك"

ws[105] = "مح"
rs[105] = " فوديتك❤️"

ws[106] = "منحرف"
rs[106] = " وينه حطرده 🌚🌚"

ws[107] = "😭"
rs[107] = " 😢😢 لتبجي"

ws[108] = "😢"
rs[108] = "  لتبجي 😭😭"

ws[109] = "شكد عمرك"
rs[109] = "زاحفه 😂😂"

ws[110] = "شكد عمرج"
rs[110] = " زاحف 😂"

ws[111] = "اقرالي دعاء"
rs[111] = " اللهم عذب المدرسين 😢 منهم الاحياء والاموات 😭🔥 اللهم عذب ام الانكليزي 😭💔 وكهربها بلتيار الرئيسي 😇 اللهم عذب ام الرياضيات وحولها الى غساله بطانيات 🙊 اللهم عذب ام الاسلاميه واجعلها بائعة الشاميه 😭🍃 اللهم عذب ام العربي وحولها الى بائعه البلبي اللهم عذب ام الجغرافيه واجعلها كلدجاجه الحافية اللهم عذب ام التاريخ وزحلقها بقشره من البطيخ وارسلها الى المريخ اللهم عذب ام الاحياء واجعلها كل مومياء اللهم عذب المعاون اقتله بلمدرسه بهاون 😂😂😂"

ws[112] = "غبي"
rs[112] = " انته الاغبى"

ws[113] = "👀"
rs[113] = " هاي عود انته جبير 😐😂"

ws[114] = "منو حبيبك"
rs[114] = " اختك 🙈"

ws[115] = "تكرهني"
rs[115] = " يي 😈"

ws[116] = "اكرهك"
rs[116] = " علساس اني احبك تهي بهي 😒🍃"

ws[117] = "😹😹"
rs[117] = " دوم حبي ❤️"

ws[118] = "الاعضميه"
rs[118] = " احسن ناس وربي❤️"

ws[119] = "الكرادة"
rs[119] = " احسن ناس وربي❤️"

ws[120] = "شارع فلسطين"
rs[120] = " احسن ناس وربي❤️"

ws[121] = "ببكن ملف"
rs[121] = " دي تحلم 😒😒"

ws[122] = "😇"
rs[122] = "  اته مو ملاك اته جهنم بنفسهه 😂"

ws[123] = "😐"
rs[123] = " شبيك صافن 😒🔥"

ws[124] = "نجب"
rs[124] = " وك 😢😞"

ws[125] = "حارة"
rs[125] = "يي كولش 😭🍃🔥"

ws[126] = "خالتك"
rs[126] = " راح اطردك لك 😒"

ws[127] = "اطرد البوت"
rs[127] = " راح ابقة احترمك❤️"

ws[128] = "هه"
rs[128] = " شدتحس"

ws[129] = "شدتحس"
rs[129] = " داحس بيك"

ws[130] = "اكولك"
rs[130] = " لتكول 😐😂"

ws[131] = "اكلك"
rs[131] = " لتكول 😐😂"

ws[132] = "بغداد"
rs[132] = " 😍 فديتهه"

ws[133] = "البصرة"
rs[133] = " احسن ناس وربي❤️"

ws[134] = "تركماني"
rs[134] = " والنعم منك❤️"


ws[135] = "اي"
rs[135] = " وجعي  ❤️🍃"

ws[136] = "تنح"
rs[136] = "عيب ابني 😒🍃"

ws[137] = "جوعان"
rs[137] = "تعال اكلني 😐😂"

ws[138] = "عطشان"
rs[138] = "روح اشرب مي"


ws[139] = "☹️"
rs[139] = "لضوج حبيبي 😢❤️🍃"

ws[140] = "😔"
rs[140] = " ليش الحلو ضايج/ه ❤️🍃"

ws[141] = "فرخ"
rs[141] = " عيبب 😱😱"

ws[142] = "كسمك"
rs[142] = " عيب 😱😱😱"

ws[143] = "نعال"
rs[143] = " بوجهك 😐😂"

ws[144] = "حروح اسبح"
rs[144] = " واخيراً 😂"

ws[145] = "حروح اغسل"
rs[145] = " واخيراً 😂"

ws[146] = "حروح اطب للحمام"
rs[146] = " واخيراً 😂"

ws[147] = "حبيبتي"
rs[147] = " منو هاي 😱 تخوني 😔☹"

ws[148] = "كبلت"
rs[148] = " بلخير 😂💔"

ws[149] = "البوت عاوي"
rs[149] = " اطردك ؟ 😒"

ws[150] = "منور"
rs[150] = " بنورك حبي 😍🍷"

ws[151] = "حفلش"
rs[151] = " افلش راسك"

ws[152] = "كردي"
rs[152] = "والنعم منك ❤️"

ws[153] = "طفي السبلت"
rs[153] = " تم اطفاء السبلت بنجاح 🌚🍃"

ws[154] = "🌝"
rs[154] = "هه"

ws[155] = "اذن المغرب"
rs[155] = "استحرم 🌚🍃"

ws[156] = "حلو"
rs[156] = "انت الاحلى 🌚❤️"

-- the main function
function run( msg, matches )
	-- just a local variables that i used in my algorithm  
	local i = 0; local w = false

	-- the main part that get the message that the user send and check if it equals to one of the words in the ws table :)
	-- this section loops through all the words table and assign { k } to the word index and { v } to the word itself 
	for k,v in pairs(ws) do
		-- change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
		if ( string.find(string.upper(msg.text), "^" .. string.upper(v) .. "$") ) then
			-- assign the { i } to the index of the reply and the { w } to true ( we will use it later )
			i = k; w = true;
		end
	end

	-- check if { w } is not false and { i } not equals to 0
	if ( (w ~= false) and (i ~= 0) ) then
		-- get the receiver :3 
		R = get_receiver(msg)
		-- send him the proper message from the index that { i } assigned to
		--send_large_msg ( R , rs[i] );
		--send_reply(msg.id, rs[i])
		reply_msg(msg.id, rs[i], ok_cb, false )
	end
	
	-- don't edit this section
	if ( msg.text == "about" ) then
		if ( msg.from.username == "ahmed_al_zaen" ) then
			R = get_receiver(msg)
			send_large_msg ( R , "Made by @ahmed_al_zaen" );
		end
	end 

end



return {
	patterns = {
		"(.*)"		
  	},
  	run = run
} 


end
